<?php

/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

namespace Application\Filter;

use Zend\Filter\AbstractFilter;

/**
 * Опеределяет часть речи слова
 * 
 *
 * @author Daddy
 */
class PartOfSpeech extends AbstractFilter
{
     /*
    Группы окончаний:
    1. прилагательные
    2. причастие
    3. глагол
    4. существительное
    5. наречие
    6. числительное
    7. союз
    8. предлог
   */
    
    // Доступные опции фильтра.
    protected $options = [
    ];  
    
    protected $part_of_speech_groups = array(
            1 => array ('ее','ие','ые','ое','ими','ыми','ей','ий','ый','ой','ем',
                        'им','ым','ом','его','ого','ему','ому','их','ых','ую','юю',
                        'ая','яя','ою','ею'),
            2 => array ('ивш','ывш','ующ','ем','нн','вш','ющ','ущи','ющи','ящий',
                        'щих','щие','ляя'),
            3 => array ('ила','ыла','ена','ейте','уйте','ите','или','ыли','ей','уй',
                        'ил','ыл','им','ым','ен','ило','ыло','ено','ят','ует','уют',
                        'ит','ыт','ены','ить','ыть','ишь','ую','ю','ла','на','ете','йте',
                        'ли','й','л','ем','н','ло','ет','ют','ны','ть','ешь','нно'),
            4 => array ('а','ев','ов','ье','иями','ями','ами','еи','ии','и','ией',
                        'ей','ой','ий','й','иям','ям','ием','ем','ам','ом','о','у',
                        'ах','иях','ях','ы','ь','ию','ью','ю','ия','ья','я','ок',
                        'мва', 'яна', 'ровать','ег','ги','га','сть','сти'),
            5 => array ('чно', 'еко', 'соко', 'боко', 'роко', 'имо', 'мно', 'жно', 
                        'жко','ело','тно','льно','здо','зко','шо','хо','но'),
            6 => array ('чуть','много','мало','еро','вое','рое','еро','сти','одной',
                        'двух','рех','еми','яти','ьми','ати',
                        'дного','сто','ста','тысяча','тысячи','две','три','одна',
                        'умя','тью','мя','тью','мью','тью','одним'),
            7 => array ('более','менее','очень','крайне','скоре','некотор','кажд',
                        'други','котор','когд','однак','если','чтоб','хот','смотря',
                        'как','также','так','зато','что','или','потом','эт','тог',
                        'тоже','словно', 'ежели','кабы','коли','ничем','чем'),
            8 => array ('в','на','по','из')
        );
    
    // Конструктор.
    public function __construct($options = null) 
    {     
        // Задает опции фильтра (если они предоставлены).
        if(is_array($options)) {
            $this->options = $options;
        }            
    }
    
    /**
     * 
     * @param string $value Слово
     * @return integer
     */    
    public function filter($value)
    {
        $len_w = mb_strlen($value);
        foreach ($this->part_of_speech_groups as $gk => $g){
            foreach ($g as $part){
                $len_part = mb_strlen($part);
                if (
                    mb_substr($value, -$len_part) == $part && $result < $len_part //любая часть речи, окончания
                    || mb_strpos($value, $part) >= (round(2*$len_w)/5) && $gk == 2 //причастие, от 40% и правее от длины слова
                    || mb_substr($value, 0, $len_part) == $part && $result < $len_part && $gk==7 //союз, сначала слОва
                    || $value == $part //полное совпадение
                ) {
                    if ($value != $part){
                        $result = mb_strlen($part);
                    } else {
                        $result = 99;
                    }
                }
            }
        }    
        
        return $result;
    }
    
}
